{
  "navAbout": "About",
  "navProject": "Projects",
  "navSkills": "Skills",
  "navContact": "Contact Me",
  "navExperiences": "Experiences",

  "aboutMe": {
    "title": "About Me",
    "description": "Computer Science Student",
    "presentation": "My name is Thomas Koenig, and I’m a second-year Computer Science student at IUT Lyon 1. Passionate about web and software development, I also compete in virtual reality (VR) at a high level, which has taught me teamwork and the drive to excel. Curious and self-reliant, I’m always looking to grow by taking on new technical challenges. I’m ready to contribute to concrete and innovative projects."
  },

  "dlCV": "Download My CV",
  "contactMe": "Contact Me",
  "scrollUp": "Scroll to Top",

  "showMore": "Show more",
  "showLess": "Show less",
  "moreInformations": "Click for more information",

  "IutSkillsTitle": "Related Skills",

  "filter": "Filter",

  "FirstName": "First Name",
  "LastName": "Last Name",
  "Email": "Email",
  "Object": "Subject",
  "Message": "Message",
  "Send": "Send",
  "Phone": "Phone",
  "Business": "Company",

  "projects": [
    {
      "title": "Studea - Apprenticeship Management Application",
      "description": "Studea is a web application for managing apprentices developed with Symfony and Vue.js.<br>It allows administrators to manage apprentice information through a dynamic interface with CSV/XML file reading, AJAX routes, error handling, and modular table displays. The entire project was developed in an agile environment using Git for version control.",
      "details": "Studea is a web application developed with Symfony (API) and Vue.js (frontend) to facilitate apprentice management within a company.<br>It centralizes apprentice data and enables dynamic data manipulation through modern, interactive interfaces.<br><br>During my internship, I contributed to the addition and improvement of many features, including the implementation of dynamic tables connected to the Symfony API,<br>the use of AJAX routes to optimize interface responsiveness, and the automated processing of CSV and XML files.<br>I also worked on frontend and backend error handling to improve application reliability.<br><br>I helped make the application more ergonomic by adapting the user interface and integrating tests to validate new features.<br>The entire project followed an agile methodology with strict Git-based version tracking.<br>This experience strengthened my fullstack skills and gave me insight into the challenges of business applications in a professional context.",
      "tags": ["Symfony", "PHP", "JavaScript", "VueJs", "Git", "Agile", "Company"],
      "image": [
        "/projectImages/studea.png"
      ],
      "skills": [
        {
          "title": "Develop (Level 3): Enhance an existing application (CE1.02)",
          "description": "Added new features to existing code (CSV upload, dynamic tables, template system)."
        },
        {
          "title": "Optimize (Level 3): Improve interface ergonomics (CE2.01)",
          "description": "Redesigned and improved Vue.js components with sorting, pagination, responsive design, and user error handling."
        },
        {
          "title": "Administer (Level 2): Set up a secure REST API (CE3.02)",
          "description": "Worked on Symfony controllers, data validation, and secure communication with the frontend."
        },
        {
          "title": "Manage (Level 3): Contribute to project management in a company (CE4.03)",
          "description": "Participated in meetings with the project lead and mentor, and task breakdown using Git."
        },
        {
          "title": "Collaborate (Level 2): Understand one's role in a team (CE6.02)",
          "description": "Worked in a team with a senior developer, sharing knowledge and performing code reviews."
        }
      ]
    },
    {
      "title": "Personal Portfolio – Web Developer Showcase",
      "description": "This portfolio is a single-page web application developed with SvelteKit to showcase my skills, projects, and experience.<br>It includes smooth animations, a responsive design, and a dynamic layout to highlight my work and technical profile.",
      "details": "My personal portfolio is built using SvelteKit, a modern web framework designed for speed and simplicity.<br>It presents my background, featured projects, and skills through a clean, interactive interface.<br><br>The portfolio is structured as a single-page application (SPA), with smooth scrolling and transition animations for an optimal user experience.<br>Skills are showcased in horizontally scrollable sections, and each project has its own dedicated modal with detailed information.<br><br>I designed the interface to be both aesthetic and functional, with Tailwind CSS and accessibility in mind.<br>The site is fully responsive and optimized for performance, using lazy loading and minimal external dependencies.<br>This project allowed me to deepen my front-end skills, particularly in Svelte, animations, component reusability, and responsive design.",
      "tags": ["SvelteKit", "Tailwind CSS", "SPA", "Frontend", "Portfolio", "Animation", "Responsive Design"],
      "link": "https://github.com/Thomkraft/MyPortfolio",
      "image",: [
        "/projectImages/Portfolio.png"
      ],
      "skills": [
        {
          "title": "Develop (Level 3): Design and implement a web application (CE1.01)",
          "description": "Built a modern, dynamic web portfolio from scratch using SvelteKit and Tailwind CSS."
        },
        {
          "title": "Optimize (Level 3): Improve web interface and user experience (CE2.01)",
          "description": "Implemented animations, smooth transitions, and a responsive design for an optimal browsing experience."
        },
        {
          "title": "Present (Level 3): Showcase professional achievements (CE4.01)",
          "description": "Structured and highlighted personal and academic projects to reflect my technical skills and interests."
        },
        {
          "title": "Adapt (Level 2): Learn and apply new technologies (CE5.01)",
          "description": "Discovered and applied SvelteKit and advanced Tailwind concepts to build a performant site."
        },
        {
          "title": "Communicate (Level 2): Share technical information clearly (CE6.01)",
          "description": "Wrote clear descriptions and structured content to make my background and work easy to understand."
        }
      ]
    },
    {
      "title": "PanierVIP – Shopping List Management Site",
      "description": "PHP/Symfony website allowing creation, management, and editing of shared shopping lists, with authentication, dynamic forms, and MySQL database.",
      "details": "PanierVIP is a website developed with PHP and Symfony that lets users create, manage, and share shopping lists online.<br>The app features a secure interface with authentication, dynamic forms to add/edit list items, and a MySQL database for data persistence.<br>It also includes permission management so multiple users can collaborate on the same list.<br>This project helped me get familiar with Symfony, form management, and relational databases in a web context.",
      "tags": ["PHP", "Symfony", "MySQL", "Dynamic Forms", "Authentication"],
      "link": "https://github.com/Thomkraft/PanierVip",
      "image": [
        "/projectImages/panierVIP.png"
      ],
      "skills": [
        {
          "title": "Develop (Level 3): Build a complete web application (CE1.01)",
          "description": "Created Doctrine entities, dynamic Symfony forms, and secure controllers."
        },
        {
          "title": "Administer (Level 2): Manage relational data persistence (CE3.01)",
          "description": "Designed the MySQL database and managed entity relationships."
        },
        {
          "title": "Manage (Level 2): Handle access control and roles (CE4.02)",
          "description": "Implemented user roles and access restrictions."
        },
        {
          "title": "Lead (Level 2): Translate a functional need into technical specifications (CE5.02)",
          "description": "Analyzed user needs to design the core features of the site."
        }
      ]
    },
    {
      "title": "SmartDesk – Agenda Management Application",
      "description": "SmartDesk is a web application for agenda and productivity management developed with Svelte and Node.js.<br>It features an interactive calendar, task manager, customizable widgets (notes, music, etc.), and a responsive interface. This project, developed in a team using agile methods, allowed me to work on the overall design and widget management.",
      "details": "SmartDesk is a collaborative agenda and productivity management application built with Svelte (frontend) and Node.js (backend).<br>Developed by a team of four students in an agile context, the app allows users to organize tasks, manage a calendar, take notes, and use interactive widgets like a music player.<br>I mainly contributed to the design of the account and login pages, ensuring their interactivity and responsiveness across devices.<br>This project helped me strengthen my fullstack web development, UI/UX, and project management skills.",
      "link": "https://github.com/Thomkraft/SmartDesk",
      "tags": ["HTML", "CSS", "JavaScript", "Svelte", "NodeJs", "TailwindCSS", "GitHub", "Git", "MySQL", "Agile"],
      "image": [
        "/projectImages/smartdesk.png"
      ],
      "skills": [
        {
          "title": "Develop (Level 3): Build a fullstack application (CE1.01)",
          "description": "Implemented authentication pages, widget management, and frontend/backend integration using SvelteKit and Node.js."
        },
        {
          "title": "Optimize (Level 2): Organize web application components (CE2.01)",
          "description": "Modular structuring of Svelte components to optimize code and maintainability."
        },
        {
          "title": "Administer (Level 1): Set up data persistence (CE3.01)",
          "description": "Connected a MySQL database to store tasks, users, and settings."
        },
        {
          "title": "Manage (Level 2): Organize agile development (CE4.01)",
          "description": "Team meetings, task tracking with Trello and GitHub, weekly sprints."
        },
        {
          "title": "Lead (Level 2): Identify solutions that meet needs (CE5.01)",
          "description": "Designed features based on productivity needs of students."
        },
        {
          "title": "Initiate (Level 2): Present a digital project (CE6.02)",
          "description": "Presented the application to a jury, with live demo and technical workflow explanation."
        }
      ]
    },
    {
      "title": "JAVA SAE – Graph Visualization and Aircraft Collision Avoidance",
      "description": "Java Swing application for creating, coloring, and visualizing graphs representing French airspace, with the goal of modeling aircraft collision avoidance.",
      "details": "This university project, completed as part of a SAE, aimed to develop a Java Swing application to model airspace and simulate aircraft collision avoidance using colored graphs and dedicated algorithms.<br><br>The application allows users to load flight and airport data, generate trajectory graphs, and apply coloring algorithms to reduce conflicts. The Swing-based GUI lets users visualize and manipulate the graph, import/export data, and get collision risk statistics.<br><br>I mainly developed the logic for CSV import and collision risk calculation.<br><br>This project improved my Java skills, GUI design, algorithmic thinking, and teamwork.",
      "link": "https://github.com/Thomkraft/projet-crash",
      "tags": ["Java", "Swing", "Graph", "Algorithms", "GUI", "GitHub"],
      "image": [
        "/projectImages/projetCrash.png"
      ],
      "skills": [
        {
          "title": "Develop (Level 3): Select and implement appropriate architectures (CE1.01)",
          "description": "Designed and implemented a GUI with Swing, integrated graph logic and handled CSV files."
        },
        {
          "title": "Optimize (Level 2): Choose suitable complex data structures (CE2.02)",
          "description": "Selected and implemented efficient graph structures for processing and visualization."
        },
        {
          "title": "Manage (Level 2): Organize team work (CE4.02)",
          "description": "Collaborated in a team of two to divide technical responsibilities."
        },
        {
          "title": "Lead (Level 2): Identify user needs (CE5.01)",
          "description": "Analyzed the specifications from the SAE and translated them into algorithmic solutions."
        }
      ]
    }
  ],
  "experiences": [
    {
      "title": "EffetB - Web Development Internship",
      "date": "April 14, 2025 – July 11, 2025",
      "description": "Contributed to the development of an apprentice management app using Symfony and Vue.js.<br>Implemented dynamic tables with Symfony and efficient AJAX route handling.<br>Processed CSV and XML files with rigorous error management and testing.<br>Optimized UI for better user experience.<br>Worked in agile methodology with version control through Git.",
      "tags": ["Symfony", "PHP", "JavaScript", "VueJs", "Git", "Agile"],
      "image": [
        "/projectImages/effetB.png"
      ]
    }
  ]
}
